app/controllers/login_controller.rb

SELECT  "users".* FROM "users" WHERE (lower(user_name) = 'admin1') LIMIT $1  [["LIMIT", 1]]
---
  def create
    user = User.find_by("lower(user_name) = ?", params[:user_name].downcase)