app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" ORDER BY "pages"."id" DESC
---
	def index
		@pages = Page.order(id: :desc)

INSERT INTO "pages" ("user_id", "page_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["page_name", "user_dashboard"], ["created_at", "2019-12-21 17:12:10.143605"], ["updated_at", "2019-12-21 17:12:10.143605"]]
---
  def create
    page = Page.create(create_page_params)