app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" ORDER BY "questions"."id" DESC
---
	def index
		@questions = Question.order(id: :desc)

SELECT  "questions".* FROM "questions" WHERE "questions"."id" = $1 LIMIT $2  [["id", 49], ["LIMIT", 1]]
UPDATE "questions" SET "question_desc" = $1, "category" = $2, "updated_at" = $3 WHERE "questions"."id" = $4  [["question_desc", "Which Japanese music group was formed to produce theme music for the anime Guilty Crown?"], ["category", "Anime"], ["updated_at", "2019-12-21 17:42:48.726672"], ["id", 49]]
---
	def update
		@question = Question.find(params[:id])
		question_update = @question.update(update_question_params)