app/controllers/traffics_controller.rb

SELECT  "traffics".* FROM "traffics" ORDER BY "traffics"."id" DESC LIMIT $1  [["LIMIT", 100]]
---
	def index
		@traffics = Traffic.order(id: :desc).limit(100)

INSERT INTO "traffics" ("user_id", "interaction", "element", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["interaction", "submit"], ["element", "log_in_form"], ["created_at", "2019-12-21 17:12:10.112603"], ["updated_at", "2019-12-21 17:12:10.112603"]]
---
  def create
    traffic = Traffic.create(create_traffic_params)