app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."id" ASC
---
	def index
		@users = User.order(id: :asc)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    # if current_user_id == user_id.to_i
      @user = User.find(params[:id])